Revit 2024 API
ElementStructuralTypeFilter Constructor (StructuralType, Boolean)
 Constructs a new instance of a filter to match elements by structural type, with the option to match all elements which are of the given structural type.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2011
Syntax
C#
public ElementStructuralTypeFilter(
	StructuralType structuralType,
	bool inverted
)
Visual Basic
Public Sub New ( _
	structuralType As StructuralType, _
	inverted As Boolean _
)
Visual C++
public:
ElementStructuralTypeFilter(
	StructuralType structuralType,
	bool inverted
)
Parameters
structuralType
Type: Autodesk.Revit.DB.Structure.StructuralType
 The structural type to match.
inverted
Type: System.Boolean
 True if the filter should match all elements which are not of the given structural type.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentOutOfRangeException |  A value passed for an enumeration argument is not a member of that enumeration
See Also
ElementStructuralTypeFilter Class
ElementStructuralTypeFilter Overload
Autodesk.Revit.DB Namespace